# Brewfile — regenerated from current machine state, then curated.
# Regenerate with:  brew bundle dump --force --describe
# Apply (install missing, uninstall removed):
#   brew bundle --file=~/Brewfile
#   brew bundle cleanup --file=~/Brewfile    # preview uninstalls
#   brew bundle cleanup --file=~/Brewfile --force

# ─── Taps ────────────────────────────────────────────────────────────────
# homebrew/bundle and homebrew/services were absorbed into core Homebrew
# in early 2025 — no longer tap them, the commands work out of the box.
tap "dopplerhq/cli"
tap "infisical/get-cli"
tap "mistertea/et"
tap "timescam/homebrew-tap"

# ─── CLI tools ───────────────────────────────────────────────────────────
brew "bat"
brew "coreutils"
brew "fzf"
brew "gh"
brew "git"
brew "mas"
brew "nano"
brew "p7zip"
brew "pre-commit"
brew "ripgrep"
brew "rtk"
brew "socat"
brew "timescam/homebrew-tap/pay-respects"
brew "tig"
brew "tmux"
brew "wget"
brew "zsh-completions"

# ─── Build / system libs ─────────────────────────────────────────────────
brew "cmake"
brew "glib"
brew "harfbuzz"
brew "icu4c@76"
brew "pkgconf"

# ─── Dev & automation ────────────────────────────────────────────────────
brew "awscli"
brew "azure-cli"
brew "dopplerhq/cli/doppler"
brew "infisical/get-cli/infisical"
brew "mistertea/et/et"

# ─── Containers / VMs ────────────────────────────────────────────────────
brew "colima", restart_service: :changed
brew "docker"
brew "docker-compose"
brew "qemu"

# ─── Data / media ────────────────────────────────────────────────────────
brew "duckdb"
brew "ffmpeg"
brew "graphviz"
brew "imagemagick"
brew "pandoc"
brew "poppler"
brew "sox"

# ─── Languages & version managers ────────────────────────────────────────
brew "go"
brew "gtk4"
brew "hugo"
brew "node"
brew "nvm"
brew "pygobject3"
brew "python@3.12"
brew "uv"

# ─── Casks ───────────────────────────────────────────────────────────────
cask "arc"
cask "bruno"
cask "chatgpt"
cask "claude"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "lm-studio"
cask "obsidian"
cask "postman"
cask "slack"
cask "visual-studio-code"

# ─── Creative ────────────────────────────────────────────────────────────
cask "adobe-digital-editions"
cask "audacity"
cask "godot"
cask "hugin"
cask "inkscape"
cask "mactex-no-gui"
cask "spotify"
cask "steam"
cask "webcamoid"

# ─── Hardware / utilities ────────────────────────────────────────────────
cask "android-file-transfer"
cask "raspberry-pi-imager"

# ─── App Store ───────────────────────────────────────────────────────────
mas "Compressor",               id: 424390742
mas "Final Cut Pro",            id: 424389933
mas "GarageBand",               id: 682658836
mas "HERU FW Update Tool",      id: 6450501473
mas "Keynote",                  id: 409183694
mas "Logic Pro",                id: 634148309
mas "Magnet",                   id: 441258766
mas "MainStage",                id: 634159523
mas "Microsoft Excel",          id: 462058435
mas "Microsoft Outlook",        id: 985367838
mas "Microsoft PowerPoint",     id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word",           id: 462054704
mas "NordVPN",                  id: 905953485
mas "Numbers",                  id: 409203825
mas "Okta Verify",              id: 490179405
mas "OneDrive",                 id: 823766827
mas "Pages",                    id: 409201541
mas "Perplexity",               id: 6714467650
mas "Slack",                    id: 803453959
mas "Sweet Home 3D",            id: 669289700
mas "Telegram",                 id: 747648890
mas "WhatsApp",                 id: 310633997
mas "Whisper Transcription",    id: 1668083311

# ─── VS Code extensions ──────────────────────────────────────────────────
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "continue.continue"
vscode "docker.docker"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "mtxr.sqltools"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
