# Taps
tap 'derailed/k9s'
tap 'hashicorp/tap'
tap 'MisterTea/et'

# Formulas
brew 'awscli'
brew 'colima'
brew 'coreutils'
brew 'derailed/k9s/k9s'
brew 'docker'
brew 'docker-compose'
brew 'docker-buildx'
brew 'git'
brew 'gradle'
brew 'hashicorp/tap/terraform'
brew 'kubectl'
brew 'mas'
brew 'maven'
brew 'MisterTea/et/et'
brew 'nano'
brew 'openjdk'
brew 'pipenv'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'tig'
brew 'wget'

# Casks
cask 'bruno'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'lm-studio'
cask 'miro'
cask 'obsidian'
cask 'pieces'
cask 'pieces-cli'
cask 'pieces-os'
cask 'visual-studio-code'

# Fun and creativity
cask 'spotify'

# App Store items
mas 'Magnet', id: 441258766
