# Taps
tap 'MisterTea/et'
tap 'redpanda-data/redpanda'

# Formulas
brew 'act'
brew 'bat'
brew 'coreutils'
brew 'fzf'
brew 'gh'
brew 'thefuck'
brew 'git'
brew 'hugo'
brew 'mas'
brew 'MisterTea/et/et'
brew 'nvm'
brew 'nano'
brew 'pipenv'
brew 'podman'
brew 'podman-compose'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rg'
brew 'tig'
brew 'wget'

# Casks
cask 'arc'
cask 'bruno'
cask 'chatgpt'
cask 'google-chrome'
cask 'iterm2'
cask 'lm-studio'
cask 'obsidian'
cask 'raspberry-pi-imager'
cask 'slack'
cask 'visual-studio-code'

# Fun and creativity
cask 'spotify'

# App Store items
mas 'Magnet', id: 441258766
